<center><h3> A Complete Guide to Data Wrangling using Pandas (Python) library </h3></center>

<h1><center>Essential Data Wrangling skills for Data Scientists in 2021</center></h1>

<h3><center> Most essential skill for Data Science - Data Wrangling with Pandas </center></h3>

![image.png](attachment:image.png)

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import pandas as pd
# Loading the mpg data set from a local .csv file using Pandas
mpg_df = pd.read_csv('~/Google Drive/JupyterNB-JC/pandas_datawrangling_complete_guide-2021/data/mpg_dataset.csv')
# Print first 5 rows of the data
mpg_df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [3]:
# Viewing the columns in the DataFrame
mpg_df.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model_year', 'origin', 'name'],
      dtype='object')

In [4]:
# dimensions of the DF
mpg_df.shape

(398, 9)

In [ ]:
mpg_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
mpg             398 non-null float64
cylinders       398 non-null int64
displacement    398 non-null float64
horsepower      392 non-null float64
weight          398 non-null int64
acceleration    398 non-null float64
model_year      398 non-null int64
origin          398 non-null object
name            398 non-null object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

In [ ]:
# Accessing a column from the DataFrame
mpg_df.mpg
mpg_df['mpg']

0      18.0
1      15.0
2      18.0
3      16.0
4      17.0
       ...
393    27.0
394    44.0
395    32.0
396    28.0
397    31.0
Name: mpg, Length: 398, dtype: float64

In [ ]:
type(mpg_df['mpg'])

pandas.core.series.Series

In [ ]:
mpg_df[['mpg']]

      mpg
0    18.0
1    15.0
2    18.0
3    16.0
4    17.0
..    ...
393  27.0
394  44.0
395  32.0
396  28.0
397  31.0

[398 rows x 1 columns]

In [ ]:
# Viewing the data type of each column in the DF
mpg_df.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower      float64
weight            int64
acceleration    float64
model_year        int64
origin           object
name             object
dtype: object

In [ ]:
mpg_df.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

In [ ]:
mpg_df.origin.describe()

count     398
unique      3
top       usa
freq      249
Name: origin, dtype: object

In [ ]:
# Values present in the column & their occurence
mpg_df.origin.value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64

In [ ]:
# check all the columns if there are any missing values 
mpg_df.isna().sum()

mpg             0
cylinders       0
displacement    0
horsepower      6
weight          0
acceleration    0
model_year      0
origin          0
name            0
dtype: int64

In [ ]:
cdf = mpg_df.copy()
id(cdf)==id(mpg_df)

False

In [ ]:
cdf[cdf['mpg']==cdf['mpg'].min()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
28,9.0,8,304.0,193.0,4732,18.5,70,usa,hi 1200d

In [ ]:
cdf[['mpg','horsepower','origin']][cdf['mpg']==cdf['mpg'].min()]

    mpg  horsepower origin
28  9.0       193.0    usa

In [ ]:
cdf['mpg'][cdf['mpg']==cdf['mpg'].min()] = 9.001

C:\Users\measwar\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
cdf[cdf['mpg']==cdf['mpg'].min()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
28,9.001,8,304.0,193.0,4732,18.5,70,usa,hi 1200d

In [ ]:
# Setting mpg value based on condition using loc
cdf.loc[cdf['mpg']==cdf['mpg'].min(),'mpg'] = 9.005
cdf.loc[cdf['mpg']==cdf['mpg'].min()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
28,9.005,8,304.0,193.0,4732,18.5,70,usa,hi 1200d

In [ ]:
# Setting mpg value based on condition using loc
cdf.loc[cdf['mpg']==cdf['mpg'].min(),['mpg','weight','name']] = 9.005,4733,'fordtorino'
cdf.loc[cdf['mpg']==cdf['mpg'].min()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
28,9.005,8,304.0,193.0,4733,18.5,70,usa,fordtorino

In [ ]:
cdf.iloc[28]

mpg                  9.005
cylinders                8
displacement           304
horsepower             193
weight                4733
acceleration          18.5
model_year              70
origin                 usa
name            fordtorino
Name: 28, dtype: object

In [ ]:
cdf.loc[0:5,'mpg':'displacement']

    mpg  cylinders  displacement
0  18.0          8         307.0
1  15.0          8         350.0
2  18.0          8         318.0
3  16.0          8         304.0
4  17.0          8         302.0
5  15.0          8         429.0

In [ ]:
cdf.loc[[1,3,5],['mpg','displacement']]

    mpg  displacement
1  15.0         350.0
3  16.0         304.0
5  15.0         429.0

In [ ]:
cdf.iloc[28,4]

4733

In [ ]:
cdf.iloc[28]['weight']

4733

In [ ]:
abc_df = cdf.set_index("name")
abc_df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
name,,,,,,,,
chevrolet chevelle malibu,18.0,8,307.0,130.0,3504,12.0,70,usa
buick skylark 320,15.0,8,350.0,165.0,3693,11.5,70,usa
plymouth satellite,18.0,8,318.0,150.0,3436,11.0,70,usa
amc rebel sst,16.0,8,304.0,150.0,3433,12.0,70,usa
ford torino,17.0,8,302.0,140.0,3449,10.5,70,usa

In [ ]:
abc_df.loc['buick skylark 320']

mpg               15
cylinders          8
displacement     350
horsepower       165
weight          3693
acceleration    11.5
model_year        70
origin           usa
Name: buick skylark 320, dtype: object

In [ ]:
rdf = cdf.loc[cdf['mpg']>17]
rdf.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
14,24.0,4,113.0,95.0,2372,15.0,70,japan,toyota corona mark ii
15,22.0,6,198.0,95.0,2833,15.5,70,usa,plymouth duster
16,18.0,6,199.0,97.0,2774,15.5,70,usa,amc hornet

In [ ]:
rdf.reset_index(inplace=True)
rdf.head()

,index,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
2,14,24.0,4,113.0,95.0,2372,15.0,70,japan,toyota corona mark ii
3,15,22.0,6,198.0,95.0,2833,15.5,70,usa,plymouth duster
4,16,18.0,6,199.0,97.0,2774,15.5,70,usa,amc hornet

In [ ]:
abc_df.reset_index(inplace=True,drop=True)
abc_df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
0,18.0,8,307.0,130.0,3504,12.0,70,usa
1,15.0,8,350.0,165.0,3693,11.5,70,usa
2,18.0,8,318.0,150.0,3436,11.0,70,usa
3,16.0,8,304.0,150.0,3433,12.0,70,usa
4,17.0,8,302.0,140.0,3449,10.5,70,usa

In [ ]:
abc_df['name'] = 'xxx'
abc_df['calc'] = abc_df['cylinders']*abc_df['mpg']
abc_df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,calc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,xxx,144.0
1,15.0,8,350.0,165.0,3693,11.5,70,usa,xxx,120.0
2,18.0,8,318.0,150.0,3436,11.0,70,usa,xxx,144.0
3,16.0,8,304.0,150.0,3433,12.0,70,usa,xxx,128.0
4,17.0,8,302.0,140.0,3449,10.5,70,usa,xxx,136.0

In [ ]:
del(rdf['index'])
rdf = rdf.drop(columns=['displacement','weight'])
rdf.head()

,mpg,cylinders,horsepower,acceleration,model_year,origin,name
0,18.0,8,130.0,12.0,70,usa,chevrolet chevelle malibu
1,18.0,8,150.0,11.0,70,usa,plymouth satellite
2,24.0,4,95.0,15.0,70,japan,toyota corona mark ii
3,22.0,6,95.0,15.5,70,usa,plymouth duster
4,18.0,6,97.0,15.5,70,usa,amc hornet

In [ ]:
rdf = rdf.rename(columns={
    'acceleration':'acc',
    'model_year':'year'
})
rdf.head()

    mpg  cylinders  horsepower   acc  year origin                       name
0  18.0          8       130.0  12.0    70    usa  chevrolet chevelle malibu
1  18.0          8       150.0  11.0    70    usa         plymouth satellite
2  24.0          4        95.0  15.0    70  japan      toyota corona mark ii
3  22.0          6        95.0  15.5    70    usa            plymouth duster
4  18.0          6        97.0  15.5    70    usa                 amc hornet

In [ ]:
weight_sorted_df = mpg_df.sort_values(by=['weight'],ascending=False)
weight_sorted_df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
44,13.0,8,400.0,175.0,5140,12.0,71,usa,pontiac safari (sw)
103,11.0,8,400.0,150.0,4997,14.0,73,usa,chevrolet impala
42,12.0,8,383.0,180.0,4955,11.5,71,usa,dodge monaco (sw)
90,12.0,8,429.0,198.0,4952,11.5,73,usa,mercury marquis brougham
95,12.0,8,455.0,225.0,4951,11.0,73,usa,buick electra 225 custom

In [ ]:
for i in cdf['origin']:
    if i == 'usa':
        cdf['price'] = 50000
    elif i == 'japan':
        cdf['price'] = 85000
    elif i == 'europe':
        cdf['price'] = 45000
cdf.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,price
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,50000
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,50000
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,50000
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,50000
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,50000

In [ ]:
for i in cdf['origin']:
    if i == 'usa':
        cdf['price'] = 50000
    elif i == 'japan':
        cdf['price'] = 85000
    elif i == 'europe':
        cdf['price'] = 45000
cdf.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,price
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,50000
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,50000
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,50000
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,50000
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,50000

In [ ]:
# Function defined to calculate the price
def calc_price(df):
    if df['origin'] == 'usa':
        df['price'] = 50000
    elif df['origin'] == 'japan':
        df['price'] = 85000
    elif df['origin'] == 'europe':
        df['price'] = 45000
    return df
weight_sorted_df = weight_sorted_df.apply(calc_price,axis=1)
weight_sorted_df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,price
44,13.0,8,400.0,175.0,5140,12.0,71,usa,pontiac safari (sw),50000
103,11.0,8,400.0,150.0,4997,14.0,73,usa,chevrolet impala,50000
42,12.0,8,383.0,180.0,4955,11.5,71,usa,dodge monaco (sw),50000
90,12.0,8,429.0,198.0,4952,11.5,73,usa,mercury marquis brougham,50000
95,12.0,8,455.0,225.0,4951,11.0,73,usa,buick electra 225 custom,50000

In [ ]:
# Creating a DF using a dictionary with list of prices & country
price_dict = {'country': ['usa','japan','europe'],
              'price': [50000,85000,45000]}
price_df = pd.DataFrame(price_dict)
print(price_df)

  country  price
0     usa  50000
1   japan  85000
2  europe  45000

In [ ]:
rdf = pd.merge(
    rdf,
    price_df,
    left_on = 'origin',
    right_on = 'country',
    how = 'left'
)
rdf.head()

,mpg,cylinders,horsepower,acc,year,origin,name,country,price
0,18.0,8,130.0,12.0,70,usa,chevrolet chevelle malibu,usa,50000
1,18.0,8,150.0,11.0,70,usa,plymouth satellite,usa,50000
2,24.0,4,95.0,15.0,70,japan,toyota corona mark ii,japan,85000
3,22.0,6,95.0,15.5,70,usa,plymouth duster,usa,50000
4,18.0,6,97.0,15.5,70,usa,amc hornet,usa,50000

In [ ]:
abc_df.loc[abc_df['origin']=='usa','price'] = 50000
abc_df.loc[abc_df['origin']=='europe','price'] = 45000
abc_df.loc[abc_df['origin']=='japan','price'] = 85000
abc_df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,calc,price
0,18.0,8,307.0,130.0,3504,12.0,70,usa,xxx,144.0,50000.0
1,15.0,8,350.0,165.0,3693,11.5,70,usa,xxx,120.0,50000.0
2,18.0,8,318.0,150.0,3436,11.0,70,usa,xxx,144.0,50000.0
3,16.0,8,304.0,150.0,3433,12.0,70,usa,xxx,128.0,50000.0
4,17.0,8,302.0,140.0,3449,10.5,70,usa,xxx,136.0,50000.0

In [ ]:
p_dict = {'usa':50000,'europe':45000,'japan':85000}
mpg_df['price']=mpg_df['origin'].map(p_dict)
mpg_df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,price
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,50000
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,50000
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,50000
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,50000
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,50000

In [ ]:
dk = mpg_df.copy()
pk_dict = {'mpg':50,'cylinders':10,'displacement':300,'horsepower':190,'weight':3500,'acceleration':14,'model_year':99,'name':'Suzuki'}
pk = pd.DataFrame(pk_dict,columns=['mpg','cylinders','displacement','horsepower','weight','acceleration','model_year','name'],index=[0])
pk.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
0,50,10,300,190,3500,14,99,Suzuki

In [ ]:
dk.append(pk).tail()

C:\Users\measwar\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\frame.py:7138: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

,acceleration,cylinders,displacement,horsepower,model_year,mpg,name,origin,price,weight
394,24.6,4,97.0,52.0,82,44.0,vw pickup,europe,45000.0,2130
395,11.6,4,135.0,84.0,82,32.0,dodge rampage,usa,50000.0,2295
396,18.6,4,120.0,79.0,82,28.0,ford ranger,usa,50000.0,2625
397,19.4,4,119.0,82.0,82,31.0,chevy s-10,usa,50000.0,2720
0,14.0,10,300.0,190.0,99,50.0,Suzuki,NaN,NaN,3500

In [ ]:
dk.append(pk,ignore_index=True).tail()

,acceleration,cylinders,displacement,horsepower,model_year,mpg,name,origin,price,weight
394,24.6,4,97.0,52.0,82,44.0,vw pickup,europe,45000.0,2130
395,11.6,4,135.0,84.0,82,32.0,dodge rampage,usa,50000.0,2295
396,18.6,4,120.0,79.0,82,28.0,ford ranger,usa,50000.0,2625
397,19.4,4,119.0,82.0,82,31.0,chevy s-10,usa,50000.0,2720
398,14.0,10,300.0,190.0,99,50.0,Suzuki,NaN,NaN,3500

In [ ]:
pd.concat([pk,mpg_df],ignore_index=True).head()

C:\Users\measwar\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

,acceleration,cylinders,displacement,horsepower,model_year,mpg,name,origin,price,weight
0,14.0,10,300.0,190.0,99,50.0,Suzuki,NaN,NaN,3500
1,12.0,8,307.0,130.0,70,18.0,chevrolet chevelle malibu,usa,50000.0,3504
2,11.5,8,350.0,165.0,70,15.0,buick skylark 320,usa,50000.0,3693
3,11.0,8,318.0,150.0,70,18.0,plymouth satellite,usa,50000.0,3436
4,12.0,8,304.0,150.0,70,16.0,amc rebel sst,usa,50000.0,3433

In [ ]:
# String operations
kdf = mpg_df.copy()
kdf['origin'] = kdf['origin'].str.strip()
kdf['origin'] = kdf['origin'].str.upper()
kdf.origin.unique()

array(['USA', 'JAPAN', 'EUROPE'], dtype=object)

In [ ]:
kdf[kdf['origin'].str.contains('eur',case=False)].head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,price
19,26.0,4,97.0,46.0,1835,20.5,70,EUROPE,volkswagen 1131 deluxe sedan,45000
20,25.0,4,110.0,87.0,2672,17.5,70,EUROPE,peugeot 504,45000
21,24.0,4,107.0,90.0,2430,14.5,70,EUROPE,audi 100 ls,45000
22,25.0,4,104.0,95.0,2375,17.5,70,EUROPE,saab 99e,45000
23,26.0,4,121.0,113.0,2234,12.5,70,EUROPE,bmw 2002,45000

In [ ]:
mpg_df.isna().sum()

mpg             0
cylinders       0
displacement    0
horsepower      6
weight          0
acceleration    0
model_year      0
origin          0
name            0
price           0
dtype: int64

In [ ]:
mpg_df['price'] = mpg_df['price'].fillna(0)

In [ ]:
mpg_df.isna().sum()

mpg             0
cylinders       0
displacement    0
horsepower      6
weight          0
acceleration    0
model_year      0
origin          0
name            0
price           0
dtype: int64

In [ ]:
mpg_df[['price','horsepower']] = mpg_df[['price','horsepower']].fillna(0)

In [ ]:
mpg_df.isna().sum()

mpg             0
cylinders       0
displacement    0
horsepower      0
weight          0
acceleration    0
model_year      0
origin          0
name            0
price           0
dtype: int64

In [ ]:
mpg_df.groupby('origin').mean()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,price
origin,,,,,,,,
europe,27.891429,4.157143,109.142857,78.257143,2423.300000,16.787143,75.814286,45000.0
japan,30.450633,4.101266,102.708861,79.835443,2221.227848,16.172152,77.443038,85000.0
usa,20.083534,6.248996,245.901606,117.136546,3361.931727,15.033735,75.610442,50000.0

In [ ]:
mpg_df.groupby(['origin','price'])['cylinders'].sum()

origin  price
europe  45000     291
japan   85000     324
usa     50000    1556
Name: cylinders, dtype: int64

In [ ]:
mpg_df.groupby(['origin','name'])['name'].count()

origin  name
europe  audi 100 ls              1
        audi 100ls               2
        audi 4000                1
        audi 5000                1
        audi 5000s (diesel)      1
                                ..
usa     pontiac phoenix          2
        pontiac phoenix lj       1
        pontiac safari (sw)      1
        pontiac sunbird coupe    1
        pontiac ventura sj       1
Name: name, Length: 305, dtype: int64

In [ ]:
mpg_df.groupby(['origin','price'])[['cylinders']].sum()

              cylinders
origin price
europe 45000        291
japan  85000        324
usa    50000       1556

#### Thank you for visiting my GitHub profile. I hope you found the Article and Code helpful.